Revit 2026 API
BRepBuilderSurfaceGeometry Methods
The BRepBuilderSurfaceGeometry type exposes the following members.
Methods
Name | Description
Create |  Construct BRepBuilderSurfaceGeometry based on a permitted Revit Surface.
CreateNURBSSurface(Int32, Int32, IList<Double>, IList<Double>, IList<XYZ>, Boolean, BoundingBoxUV)
CreateNURBSSurface(Int32, Int32, IList<Double>, IList<Double>, IList<XYZ>, IList<Double>, Boolean, BoundingBoxUV)
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
BRepBuilderSurfaceGeometry Class
Autodesk.Revit.DB Namespace